{"count": 10, "news": [{"title": "Watch Live: Fani Willis hearing underway over removing her from Trump Georgia case", "top_image": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/02/15/f8c76255-692b-411a-b47b-4bdfab3e90f2/thumbnail/1200x630g4/f6099f41de5e90ff83d812b377f0b6e4/ap24046721014592.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "images": ["https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/23/ef0618e5-35d6-4f65-835d-8697d134f4d9/thumbnail/140x90/d720ffb14cb5c373b43aecd61e35bc42/gettyimages-2023793751.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2024/03/01/11fb4f8c-1057-4eee-b22c-51915467a4c4/thumbnail/1200x630/dd5f19dae2b37cce2becc7495c63cfa4/herridge-promo.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2024/02/29/1949e3cd-4274-45a2-8757-2dc521b649d4/thumbnail/1200x630/27e30dd4c0598d6dbbe0b6e5426fbcc9/ap24060046547059.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets3.cbsnewsstatic.com/hub/i/r/2024/02/15/f8c76255-692b-411a-b47b-4bdfab3e90f2/thumbnail/140x90g4/19946faab891e109b265fb536b8335d1/ap24046721014592.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2024/03/01/584ef8fd-e513-40e8-a286-6a91fbb2a6ba/thumbnail/620x414/f671e8ddacd15f97e58d3eb86e1d7cf5/gettyimages-2043986592.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/16/4cdc5f27-85ce-42da-97ac-4fde07c7780d/thumbnail/620x413/c4591f5dede35279d4c67a8ea361118c/gettyimages-2006236842.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/15/57507997-14eb-40f3-a5bf-5fc57d2a9407/thumbnail/620x413/7293776a291912e4cde9ee967fcb18ec/2024-02-15t160841z-1114952228-rc2236az36m0-rtrmadp-3-usa-trump-georgia.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/19/68eba163-8b89-4be1-8eaa-04ea9461e0c2/thumbnail/1200x630g3/996ecf5de4a1dde7f7648a0cb540d2ff/gettyimages-2013056095.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2024/03/01/ddd7b4e2-1126-4b05-98e2-6bf9c8a5eb85/thumbnail/140x90/8b5bd7e4ce4b0f980eabeb0f9211fd82/gettyimages-2050671871.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/19/85ae0a64-c36d-4c93-bf0f-e6b6f8ea720e/thumbnail/140x90g2/a988cc105824c209ceeffeff44751b89/gettyimages-1917588722.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets3.cbsnewsstatic.com/hub/i/r/2024/02/15/f8c76255-692b-411a-b47b-4bdfab3e90f2/thumbnail/1200x630g4/f6099f41de5e90ff83d812b377f0b6e4/ap24046721014592.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/01/201fc91d-57f4-42f3-bb2e-0be12df27c9a/thumbnail/140x90/666d4bf83f34be1f64f5d6bf97c63a4e/gettyimages-1791404276.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3", "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/01/201fc91d-57f4-42f3-bb2e-0be12df27c9a/thumbnail/1200x630/d6f650860e51b003f7d8d2a195ef80c2/gettyimages-1791404276.jpg?v=b15ba9ca383d8472a236fb5b5c7ca2b3"], "videos": [], "url": "https://www.cbsnews.com/news/fani-willis-trump-georgia-case-hearing-fulton-county-today/", "date": "Fri, 01 Mar 2024 19:54:57 GMT", "short_description": "Watch Live: Fani Willis hearing underway over removing her from Trump Georgia case  CBS NewsLive updates: Trump classified documents hearing, Fani Willis disqualification closing arguments  CNN'Fraud on this court:' Defense says Wade and Willis lied   The Atlanta Journal ConstitutionTexts show prosecutor's ex-law partner gave info for effort to remove Fani Willis from election case  The Associated PressGeorgia judge hears final arguments in affair allegations against Fani Willis  Fox News", "text": "Atlanta — Arguments are underway Friday over an effort by former President Donald Trump and several of his co-defendants in the Georgia election interference case to disqualify Fulton County District Attorney Fani Willis and her office over allegations that Willis engaged in a romantic relationship with special prosecutor Nathan Wade.\n\nThe proceeding before Fulton County Superior Court Judge Scott McAfee caps a series of extraordinary hearings held after Michael Roman, a longtime GOP operative charged alongside Trump, alleged in January that Willis and Wade had an \"improper\" romantic relationship, and that the district attorney financially benefited from it. Wade and Willis were in attendance for portions of the hearing, sitting at the prosecutors' table.\n\nTrump and seven others joined Roman's effort to disqualify Willis, Wade and her office from prosecuting the racketeering case against them. They are seeking to have the charges against them dismissed.\n\n\"If this court allows this kind of behavior to go on and allows DAs across the state by its order to engage in these kinds of activities, the entire public confidence in the system will be shot and the integrity of the system will be undermined,\" said John Merchant, a defense attorney representing Roman.\n\nFulton County District Attorney Fani Willis testifies during a hearing on Feb. 15, 2024, in Atlanta. ALYSSA POINTER / Getty Images\n\nRoman claimed that the relationship between Wade and Willis began before she hired him as special prosecutor in the case against Trump in early November 2021. The two admitted in a court filing that they did have a personal relationship, but said it started in 2022.\n\nBoth Willis and Wade testified during evidentiary hearings last month and divulged personal details about their relationship, financial affairs and travels to places like Napa Valley, Belize and Aruba. During several hours on the witness stand, Willis forcefully defended herself from accusations she acted improperly and financially benefited from Wade's hiring.\n\nDefense attorneys claimed that Wade paid for hotel rooms, cruises and getaways, though both prosecutors said they split the costs associated with their travels and that Willis often reimbursed Wade in cash. To demonstrate that Willis typically used cash to cover expenses, on Tuesday prosecutors filed an affidavit from Stan Brody, who worked at a winery in Napa that she and Wade visited last year. Brody asserted that Willis paid $400 in cash for two bottles of wine and a tasting.\n\nThe district attorney had accused Ashleigh Merchant, Roman's attorney, of spreading lies and \"salacious\" rumors.\n\n\"You've been intrusive into people's personal lives,\" Willis said during her testimony Feb. 16. \"You're confused. You think I'm on trial. These people are on trial for trying to steal an election in 2020. I'm not on trial, no matter how hard you try to put me on trial.\"\n\nFriday's hearing\n\nFulton County Superior Judge Scott McAfee presides during final arguments in the District Attorney Fani Willis disqualification hearing at the Fulton County Courthouse on March 1, 2024, in Atlanta. ALEX SLITZ/POOL/AFP via Getty Images\n\nDefense attorneys representing Trump and his co-defendants were given 90 minutes to make their arguments for why Willis and Wade should be disqualified. Prosecutors will have the same amount of time to present their case.\n\nDuring his presentation, John Merchant accused Willis of developing a financial interest in the case in violation of the rules of professional conduct, which \"created the appearance of unfairness by setting a prosecutorial relationship with her boyfriend that she had been dating for two years, according to the testimony.\"\n\nThough Wade and Willis testified that they split expenses related to their trips, Merchant said Willis received a benefit of roughly $9,200 that cannot be accounted for. He accused the district attorney of \"intentionally\" crafting a scheme to benefit Wade.\n\n\"She put her boyfriend in the spot, paid him and them reaped the benefits from it,\" Merchant said. \"She created the system and then didn't tell anyone about it.\"\n\nHe said that if McAfee finds that Wade and Willis' relationship began in 2019 — roughly two years before his appointment as special prosecutor — and Wade's hiring was improper, it undermines the indictment charging Trump and his co-defendants.\n\nBoth Steve Sadow, who is representing Trump, and Craig Gillen, another defense lawyer, accused Willis of engaging in misconduct when she delivered a speech at Big Bethel AME Church in January, shortly after the allegations about her relationship with Wade were made public. Though Willis did not mention Wade by name, she defended his qualifications and suggested that racism was behind the claims.\n\nGillen and Sadow said the speech was designed to prejudice potential jurors against the defendants.\n\n\"She chose to inject race into the minds of the listeners, and virtually everybody in this community and literally everyone in this country has reviewed and analyzed that speech that she made in a premeditated way,\" Gillen said.\n\nCiting records from Wade's cellphone that were obtained by the defense, defense attorney Richard Rice suggested they communicated extensively throughout 2021.\n\n\"I don't even think lovestruck teenagers communicate that much,\" he said.\n\nRice also told McAfee that the two \"have some difficulty expressing the truth when it comes to their relationship and these cases.\" Wade, he claimed, lied in filings submitted in his divorce proceedings. He accused Willis of falsely certifying on ethics forms that she had not received gifts worth more than $100.\n\n\"It defies imagination that she could somehow forget about all these trips, all these dinners, all these day trips,\" Rice said.\n\nHarry MacDougald, who is representing former Justice Department official Jeffrey Clark, claimed that Willis and Wade have made the Fulton County District Attorney's Office \"a global laughing stock because of their conduct.\"\n\nThe relationship timeline\n\nThe timeline surrounding Willis and Wade's relationship has emerged as a crucial issue in the effort to kick the district attorney and her office off the case. Willis' former longtime friend, Robin Yeartie, claimed the relationship with Wade pre-dated his appointment on Nov. 1, 2021. Yeartie testified that she witnessed the couple being affectionate with one another.\n\nFulton County Special Prosecutor Nathan Wade raises his hand during a hearing in Atlanta on Feb. 15, 2024. ALYSSA POINTER / REUTERS\n\nDefense attorneys also questioned Terrence Bradley, Wade's former law partner and divorce attorney, about his communications with Wade and text messages he exchanged with Merchant about the relationship between the two prosecutors before she filed a motion exposing their private dealings.\n\nAfter asserting attorney-client privilege while testifying twice last month, Bradley was called back to the stand at a hearing Wednesday. He said he had been \"speculating\" when he told Merchant in a message that the relationship between Wade and Willis started before Wade's hiring. Bradley repeatedly said he had no direct knowledge of when it began.\n\nProsecutors sought to discredit both Bradley and Yeartie. They revealed during the evidentiary hearing last month that Bradley left the firm he shared with Wade following an accusation of sexual assault. Bradley forcefully denied the allegation, and said earlier this week that he has not spoken to Wade in more than a year.\n\nLawyers with the district attorney's office also said Yeartie left her job there on poor terms after she was told she could either resign or be terminated. Willis testified last month that she has not spoken with Yeartie for more than a year, and said she \"betrayed\" their friendship.\n\nIt's unclear when McAfee will make a decision on whether to remove Willis and her office from the matter involving Trump, but the controversy over her romantic relationship with Wade has cast a shadow over the prosecution and derailed the case for several weeks. Trump and his allies face charges over alleged efforts to overturn the results of the 2020 presidential election in Georgia. Several original co-defendants have taken plea deals, while the remaining defendants have all pleaded not guilty.\n\nHeading into Friday's hearing, there were lingering disputes over evidence that both sides have sought to admit. Defense attorneys want McAfee to admit Wade's cellphone data as evidence, claiming it shows he was in the vicinity of a condo Willis rented from Yeartie in Hapeville, south of Atlanta, at least three dozen times in 2021. They said testimony about location data from Wade's phone show that he was near Willis' condo late at night and into the early morning hours in the months before he was tapped as special prosecutor.\n\nProsecutors have also said Brody, who worked at the Napa winery that Wade and Willis visited, is available to testify Friday if the court declines to accept his affidavit.\n\nMcAfee said at the start of the hearing that he was ready to hear the legal argument regarding what prosecutors and defense attorneys have already presented and said he may be able to make a decision without the cellphone records and testimony from Brody. The judge did not rule out further proceedings for admitting the additional information.", "publisher": {"href": "https://www.cbsnews.com", "title": "CBS News"}}, {"title": "Texas’ biggest wildfire in history could spread more rapidly with dry air and fierce winds fueling flames through the weekend", "top_image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t234500z-110408055-rc2wb6aw5f8g-rtrmadp-3-usa-wildfires.jpg?c=16x9&q=w_800,c_fill", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/image-from-ios-2.jpg?c=original", "https://media.cnn.com/api/v1/images/stellar/prod/10-after-fires-closer-view-of-burned-homes-southern-fritch-texas-28feb2024-wv2.jpg?c=16x9&q=h_720,w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/img-8139-20240301022544502.jpg?c=original", "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t195424z-1614761818-rc2sb6ajnz6m-rtrmadp-3-usa-wildfires.jpg?q=w_1110,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/230925131659-climate-change-impact-wildfires-explained.jpg?c=16x9&q=w_850,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/09-before-fires-closer-view-of-homes-southern-fritch-texas-04aug2023.jpg?c=16x9&q=h_720,w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/ap24060063338121.jpg?q=w_1110,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/141230150408-david-williams-profile.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/150108121625-joe-sutton-profile.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t234500z-110408055-rc2wb6aw5f8g-rtrmadp-3-usa-wildfires.jpg?c=16x9&q=w_800,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/171019114223-holly-yan-byline.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/231218151513-01-wildfire-ca-090720-file.jpg?c=16x9&q=h_144,w_256,c_fill"], "videos": [], "url": "https://edition.cnn.com/2024/03/01/us/texas-panhandle-smokehouse-creek-fire-oklahoma-friday/index.html", "date": "Fri, 01 Mar 2024 19:08:00 GMT", "short_description": "Texas’ biggest wildfire in history could spread more rapidly with dry air and fierce winds fueling flames through the weekend  CNNA Texas town watched helplessly as the largest wildfire in state history engulfed it  The Associated PressTexas Wildfires: What We Know About the Smokehouse Creek Fire  The New York TimesTexas wildfires: two people killed in state’s largest, barely contained blaze  The Guardian USDrone video shows apocalyptic scene from largest wildfire in Texas history  Fox Weather ", "text": "CNN —\n\nThe devastation wrought by deadly wildfires that have killed two people, destroyed thousands of cattle and charred more than 1 million acres could intensify as ferocious winds and dry air fuel flames Friday and through the weekend.\n\nThe most destructive blaze, the Smokehouse Creek Fire, is now Texas’ largest wildfire on record – swallowing at least 1,050,000 acres in the state and another 31,500 acres in Oklahoma. As of Friday morning, the mammoth inferno was only 15% contained.\n\nIt’s one of four wildfires tearing across the Texas Panhandle this week, destroying dozens of homes and leaving businesses in shambles. Together, the fires have scorched an amount of land roughly equivalent to the state of Delaware.\n\nThe latest developments\n\n• The second-largest blaze burning in Texas, the Windy Deuce Fire,﻿ has torched 142,000 acres and was 55% contained as of Thursday night, according to the Texas A&M Forest Service.\n\n• The Grape Vine Creek Fire has incinerated 30,000 acres and is 60% contained.\n\n• The Magenta Fire has seared 3,300 acres and is 85% contained.\n\nMason Holloway and Hugh Lively look through the remains of a relative's home that was destroyed by the Smokehouse Creek wildfire in Canadian, Texas, on Wednesday, February 28. Nick Oxford/Reuters\n\n• Rough terrain and topography have hindered firefighters from accessing parts of the Smokehouse Creek Fire, Texas A&M Forest Service spokesperson Juan Rodriguez said Thursday evening. The agency has about 200 personnel battling the blaze, he said.\n\n• After a brief slowdown Thursday due to lighter winds and some precipitation, the Smokehouse Creek Fire will likely spread faster Friday and this weekend as drier air and stronger winds sweep in.\n\n• High temperatures in the Texas and Oklahoma panhandles will reach the 80s on Saturday and Sunday. Winds could gust up to 40 mph by Sunday, according to the National Weather Service office in Amarillo, Texas.\n\nA telephone pole burns from the Smokehouse Creek Fire on Wednesday in Canadian. David Erickson/AP\n\n• The heightened fire risk comes as Texans prepare to celebrate the state’s Independence Day on Saturday, prompting urgent warnings from officials to exercise extreme caution when using fireworks.\n\n• A staggering 400,000 acres have been burned in Hemphill County, where scores of homes have been destroyed and thousands of cattle have died, Hemphill County AgriLife Extension agent Andy Holloway said. A truck driver was killed in Hemphill County by the Smokehouse Creek fire, her family said.\n\n• Another woman was killed when her home was destroyed in Hutchinson County, her family said. Search-and-rescue crews have started clearing neighborhoods in the county, and officials encouraged anyone with missing loved ones in the area to contact a Wildfire Information Line.\n\n﻿• The city of Fritch, Texas, is under a boil water notice – though Hutchinson County officials acknowledged that’s “hard to do since many residents are without electricity and or gas.” Water bottles are being distributed at several churches and other locations, officials said.\n\nA satellite image shows Fritch, Texas in August 2023. Maxar Technologies A satellite image shows damage to homes in Fritch, Texas on February 28. Maxar Technologies Satellite images show homes in Fritch, Texas, before the fire (in August 2023), and after (on Wednesday).\n\n• Texas Gov. Greg Abbott is scheduled to visit the panhandle Friday and hold an afternoon press conference.\n\n‘She basically couldn’t breathe … and didn’t make it’\n\nTruck driver Cindy Owen was working about 50 miles north of Pampa, Texas, on Tuesday when she got caught in the Smokehouse Creek Fire, her sister-in-law told CNN.\n\nTruck driver Cindy Owen often pulled over to give people coats on cold days, her sister-in-law said. Family photo\n\n“She basically couldn’t breathe, and she evacuated the truck and tried to run for safety and didn’t make it,” said Jennifer Mitchell, the wife of Owen’s brother. “So she was found with burns, and it was about 90% of her body.”\n\nOwen was on a video chat as the disaster unfolded, and family members scrambled to find someone to help her, Mitchell said.\n\nBut the inferno quickly overwhelmed her. Owen died as a result of the fire in Hemphill County, Texas Department of Public Safety Sgt. Chris Ray said.\n\nOwen, 44, was devoted to her family and “would do anything for anybody,” including pulling over on cold days to give people coats, her sister-in-law said.\n\n“She was everybody’s friend, and everybody knew her,” Mitchell said. “There’s nothing bad to say about her. She was the best person ever.”\n\n‘There was no way she could’ve gotten out’\n\nJoyce Blakenship, right, and her grandson Nathan Blakenship. Courtesy Nathan Blakenship\n\nIn nearby Hutchinson County, 83-year-old Joyce Blankenship was also killed by the Smokehouse Creek Fire, her family said.\n\n“The house was gone,” her grandson Nathan Blankenship said. “There was no way she could’ve gotten out.”\n\nThe beloved grandmother was well-known in the small community of Stinnett, her step-grandson Lee Quesada said.\n\n“She used to be a substitute teacher in the area before she became a housewife,” Quesada said. “She will be missed by all.”\n\nA devastating impact on the cattle industry\n\nThe wildfires have killed thousands of cattle and destroyed vital equipment in the Texas Panhandle.\n\nThe 120-year-old Turkey Track Ranch – nicknamed the “Prize of the Panhandle” – estimates 80% of its nearly 80,000-acre property has been scorched.\n\n“The loss of livestock, crops, and wildlife, as well as ranch fencing and other infrastructure throughout our property, as well as other ranches and homes across the region is, we believe, unparalleled in our history,” the Turkey Track Ranch Family Group said in a statement.\n\nBut the group also expressed optimism: “Nature mends after fire and will grow again all the natural grasses, vegetation, and tree cover in our beloved ranch oasis.”\n\nTexas Department of Agriculture Commissioner Sid Miller said the damage could be “catastrophic” to the region.\n\n“These fires not only threaten lives and property but will also have a substantial impact on our agriculture industry,” Miller said. “Over 85% of the state’s cattle population is located on ranches in the Panhandle. There are millions of cattle out there, with some towns comprising more cattle than people.”\n\nThe Texas Farm Bureau has established the Texas Panhandle Wildfire Relief Fund to help farmers and ranchers impacted by the fires.\n\nCNN’s Mary Gilbert, Andy Rose, Eric Zerkel and Steve Almasy contributed to this report.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Powerful blizzard dumps snow across Sierra Nevada with 145 mph wind gusts in biggest storm of the season", "top_image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-03/240301-blizzard-ch-1145-e2bcdf.jpg", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-03/240301-blizzard-ch-1145-e2bcdf.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2021_44/3517122/kathryn-prociv.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/rockcms/2024-03/240301-blizzard-ch-1147-ca1138.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/rockcms/2024-03/240301-blizzard-ch-1148-7e9397.jpg"], "videos": [], "url": "https://www.nbcnews.com/news/us-news/powerful-blizzard-dumps-snow-sierra-nevada-145-mph-wind-gusts-biggest-rcna141385", "date": "Fri, 01 Mar 2024 17:53:06 GMT", "short_description": "Powerful blizzard dumps snow across Sierra Nevada with 145 mph wind gusts in biggest storm of the season  NBC NewsBlockbuster blizzard is slamming California with 12 feet of snow possible, 100-mph wind gusts  CNNMajor Snowstorm Starts to Pound Mountains Around Lake Tahoe  The New York TimesCalifornia's Sierra To See Blizzard, Up To 12 Feet Of Snow | Weather.com  The Weather ChannelBlizzard warning for Sierra Nevada, Yosemite National Park closed  The Washington Post", "text": "A powerful blizzard is underway in the Sierra Nevada and forecast to bring relentless snow over the next two days, with wind gusts already clocking 145 mph at the highest peaks in the Sierra and creating dangerous white-out conditions.\n\nThis is the biggest snowstorm for the Sierra season, with blizzard warnings active for the Sierra Nevada and parts of eastern Nevada.\n\nHeavy snow is already falling with areas are forecast to pick up between five to 10 feet of snow, and localized areas up to 12 feet.\n\nSkiers in Truckee, CA., on Thursday. Andy Barron / AP\n\nWith snow falling two to four inches an hour, travel is life-threatening and impossible, and portions of the highly-traveled I-80 will likely close for days.\n\nCalifornia Highway Patrol in Truckee, California, said Friday that “travel is highly discouraged,” noting that conditions over Donner Summit deteriorated Thursday night, causing “a traffic mess.” Trucks are now at maximum restrictions.\n\nAdding to the wintry mix, winds are roaring with a 145 mph wind gust reported on the high peaks west of Lake Tahoe. Strong winds gusting 50 to 100 mph will be possible this weekend for the Sierra chain and all elevated areas and mountains across California and into Utah.\n\nThe snow and wind will taper off by Sunday.\n\nA worker clears snow in the Sierra Nevada mountains on Thursday near Kingvale, CA. Mario Tama / Getty Images\n\nThe UC Berkeley Central Sierra Snow Lab, based in Soda Springs, California, said Friday it received 19.1 inches of snow in the last day.\n\n“Conditions have already deteriorated this morning with gusty winds and significantly reduced visibility. The next 24 hours will be the heaviest portion of the storm,\" the lab said.\n\nMeanwhile, a backcountry avalanche watch is in effect through 5 p.m. local time Sunday for the central Sierra Nevada Mountains between Yuba Pass and Ebbetts Pass, including the Greater Lake Tahoe area with “high to extreme” avalanche danger and “large to very large avalanches expected.”\n\nYosemite National Park has also asked visitors to be out by Friday afternoon due to possibly dangerous conditions through at least noon Sunday.\n\nThe California Governor’s Office of Emergency Services has prepositioned fire personnel and equipment in multiple counties “to be able to respond if needed” due to the winter storm.\n\nNevada Gov. Joe Lombardo said Friday: “This storm is expected to bring dangerous temperatures and conditions to our state, and it’s critical that Nevada families are prepared.”\n\nHe said that the state’s department of transportation, energy and emergency management are working “to maximize preventative measures and recovery efforts.”\n\nSeveral school districts including Northern Nevada’s Washoe County School District and Storey County Schools, and California’s Tahoe Truckee Unified School District and Lake Tahoe Unified School District were closed Friday due to the weather.\n\nLarge snowstorms are common in March. Sierra snowfall usually reaches its peak snowpack on April 1 before the melt season begins.", "publisher": {"href": "https://www.nbcnews.com", "title": "NBC News"}}, {"title": "Judge Cannon signals doubts about Jack Smith's timeline for Trump trial in Florida - POLITICO", "top_image": "www.politico.com/favicon.ico", "images": [], "videos": [], "url": "https://www.politico.com/news/2024/03/01/judge-cannon-signals-doubts-about-jack-smiths-timeline-for-trump-trial-in-florida-00144449", "date": "Fri, 01 Mar 2024 18:43:16 GMT", "short_description": "Judge Cannon signals doubts about Jack Smith's timeline for Trump trial in Florida  POLITICOView Full Coverage on Google News", "text": "Judge Cannon signals doubts about Jack Smith's timeline for Trump trial in Florida  POLITICOView Full Coverage on Google News", "publisher": {"href": "https://www.politico.com", "title": "POLITICO"}}, {"title": "Michelle Troconis trial: Woman convicted of helping boyfriend cover up Connecticut wife's murder", "top_image": "https://i.abcnewsfe.com/a/f48f26ce-6d97-4c62-886d-d2524f2ed717/michelle-troconis-ap-jt-240227_1709059312415_hpMain_16x9.jpg?w=1600", "images": ["https://i.abcnewsfe.com/a/f48f26ce-6d97-4c62-886d-d2524f2ed717/michelle-troconis-ap-jt-240227_1709059312415_hpMain_4x3.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s.abcnews.com/images/US/wirestory_003035756ea4c089eeed2cfda211fe28_1x1_144.jpg", "https://s.abcnews.com/assets/dtci/images/hulu.svg", "https://s.abcnews.com/images/GMA/princess-kate-gty-jef-240229_1709215117878_hpMain_1x1_144.jpg", "https://i.abcnewsfe.com/a/f48f26ce-6d97-4c62-886d-d2524f2ed717/michelle-troconis-ap-jt-240227_1709059312415_hpMain_16x9.jpg?w=992", "https://s.abcnews.com/images/US/michelle-troconis-ap-jt-240227_1709059312415_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/babylon-park-body-parts-01-ht-jt-240301_1709314930206_hpMain_1x1_144.jpg", "https://i.abcnewsfe.com/a/fe531f5f-a4da-4de7-b64b-67576326e97c/Michelle-Troconis-1-ap-jm-220123_1706017785651_hpMain.jpg", "https://i.abcnewsfe.com/a/0954e1d1-97f6-4248-9ee7-f23ac1fb8f4c/jennifer-dulos-ap-jt-240227_1709059544974_hpEmbed_6x5.jpg", "https://i.abcnewsfe.com/a/5e537b9c-ff64-4c8e-85e5-8841a68af204/Folis-Dulos-gty-jm-240123_1706017729535_hpEmbed_17x12.jpg", "https://i.abcnewsfe.com/a/f48f26ce-6d97-4c62-886d-d2524f2ed717/michelle-troconis-ap-jt-240227_1709059312415_hpMain_16x9.jpg?w=1600", "https://s.abcnews.com/images/General/Breaking-News-banner-abc-ps-181024_hpMain_1x1_144.jpg", "https://i.abcnewsfe.com/a/44ecd1cb-0eb0-4687-af7d-12cc503fd0e5/michelle-troconis-01-ap-jt-240227_1709059432069_hpMain.jpg"], "videos": [], "url": "https://abcnews.go.com/US/michelle-troconis-trial-verdict-reached-case-woman-accused/story?id=106593360", "date": "Fri, 01 Mar 2024 19:02:33 GMT", "short_description": "Michelle Troconis trial: Woman convicted of helping boyfriend cover up Connecticut wife's murder  ABC NewsJennifer Dulos: Michelle Troconis Convicted of Conspiracy to Commit Murder  PEOPLESocialite Guilty of Conspiring to Murder Connecticut Mom Jennifer Dulos  The Daily BeastMichelle Troconis found guilty of conspiring to murder missing Connecticut mother Jennifer Dulos  CNNLIVE COVERAGE: Jury finds Michelle Troconis guilty on all charges  Eyewitness News 3", "text": "Michelle Troconis is set to be sentenced on May 31.\n\nMichelle Troconis, who stood trial in connection with the disappearance of Jennifer Dulos, her live-in boyfriend's estranged wife, has been found guilty on all counts.\n\nTroconis was convicted of conspiracy to commit murder, tampering with physical evidence, conspiracy to commit tampering with physical evidence and hindering prosecution.\n\n\"We have lost a mother, daughter, sister, cousin, and cherished friend,\" Carrie Luft, a spokeswoman for Jennifer Dulos' family and friends, said in a statement Friday.\n\nLuft said the \"verdict represents the meticulous collection, analysis, and presentation of evidence to illuminate an unconscionable series of crimes.\"\n\n\"That immense body of evidence also serves to highlight the gaps that remain in this case -- most important, that Jennifer Farber Dulos still has not been found,\" Luft said. \"It is our hope that the resurgent public interest in this case might spur new, viable leads.\"\n\nThis undated contributed photo courtesy of the Farber family shows Jennifer Farber Dulos. Gloria Farber, the 88-year-old mother of Connecticut mother-of-five Jennifer Dulos, testified at a murder conspiracy trial Wednesday, Feb. 21, 2024, that she has not seen or communicated with her daughter since she disappeared and was presumed by police to be murdered in 2019. Courtesy of the Farber Family via AP\n\nJennifer Dulos, a Connecticut mother of five, disappeared on May 24, 2019, during a custody dispute with her estranged husband, Fotis Dulos. Her body has never been found but a judge has declared her legally dead.\n\nFotis Dulos died by suicide in January 2020, weeks after he was charged in Jennifer Dulos' murder. Prosecutors allege Fotis Dulos killed his estranged wife in her garage on May 24, 2019.\n\nFotis Dulos walks into Stamford Superior Court, June 26, 2019. Hartford Courant/TNS via Getty Images\n\nAt Troconis' trial, the jury saw interrogation video in which Troconis admitted to lying about seeing Fotis Dulos at their home on the morning Jennifer Dulos vanished, New Haven ABC affiliate WTNH reported.\n\n\"I have no idea where Jennifer is, and that's 100%,\" Troconis said in the interrogation video, according to WTNH. \"I just know that I went as the stupid girlfriend to help him out, because he told me, 'Come and clean the house,' and I did.\"\n\nMichelle Troconis listens to arguments at the start of her trial in Stamford, CT, Jan. 11, 2024. Richard Harbus/AP\n\n\"[Fotis Dulos] told me Jennifer is a monster,\" Tronocis said in the interrogation video, according to WTNH. \"He hated her.\"\n\nPolice testified that surveillance footage showed Fotis Dulos driving, with Troconis in the passenger seat, in Hartford later on the day Jennifer Dulos vanished, with Fotis Dulos making stops to throw out alleged evidence in trash cans, the Hartford Courant reported. In court, jurors were shown zip ties, gloves and stained clothing prosecutors said were pulled from the trash cans.\n\nDefense attorney Jon Schoenhorn said Troconis never denied being in the car with her boyfriend, but said that she denied having any involvement in or any knowledge of crimes Fotis Dulos may have committed.\n\nDefendant Michelle Troconis appears during her trial at Connecticut Superior Court in Stamford, Conn., on Feb. 22, 2024. Troconis is on trial for charges related to the disappearance and death of New Canaan resident Jennifer Dulos. Tyler Sizemore/Hearst Connecticut Media, Pool via AP\n\nIn closing arguments, prosecutor Michelle Manning reminded the jury of the garage where investigators believe Fotis Dulos killed his wife and the blood-soaked items thrown in the trash.\n\n\"There's blood spatter throughout the garage, throughout the undercarriage of two cars, footprints and swipes of blood,\" Manning said. \"Her blood-soaked shirt and bra thrown out ... along with zip ties, sponges and duct tape. Make no mistake: This was a deliberate, intentional murder.\"\n\n\"Jennifer is dead. And Fotis and Michelle Troconis intended that to happen. They agreed to work together to make it happen,\" Manning said. \"This trial is very simple: It's about a conspiracy and about a cover-up. It's about Michelle Troconis' actions and about how she and Fotis Dulos conspired together to murder the woman who was standing in their way. It's about the frustration of Fotis Dulos not seeing his kids ... and every time those kids came around, Michelle Troconis had to leave her home ... and we know she was sick of it.\"\n\n\"The frustration turned to anger and hatred,\" Manning told the jurors. \"Listen to her own words in the [police] interviews -- how she describes Jennifer -- someone she has never met. She describes her as manipulating, angry, toxic.\"\n\nSchoenhorn, the defense attorney, stressed in closing arguments, \"Whatever Fotis Dulos' role was in the disappearance -- and I'll say the likely death of Jennifer Dulos -- Michelle Troconis did not know. She did not know that Fotis Dulos planned to harm her.\"\n\n\"There's nothing to suggest that Michelle would even think that Fotis was capable of doing anything like that,\" Schoenhorn said.\n\n\"This is not Fotis Dulos' trial,\" he continued. \"Because it's Michelle Troconis' trial, [to convict her] you must find beyond a reasonable doubt that Michelle conspired with Fotis Duos, not just to cause harm to Jennifer Dulos, but to murder her.\"\n\nMichelle Troconis appears in court on day 21 of her criminal trial at Connecticut Superior Court in Stamford, Conn., on Feb. 14, 2024. Troconis is on trial for charges related to the disappearance and death of New Canaan resident Jennifer Dulos. Tyler Sizemore/Hearst Connecticut Media, Pool via AP\n\nTo convict her, he told the jury, \"You have to find beyond a reasonable doubt, various elements that Michelle was part of a plot to get rid of evidence -- some microscopic, some in opaque garbage bags -- but that she knew what was in it, knew its purpose. And what she did was the same exact intent as whatever Fotis Dulos had planned.\"\n\nAfter the verdict, Paul Ferencek, state's attorney for the Stamford/Norwalk Judicial District, said in a statement, \"While it's our hope that today's verdict brings Jennifer's family and friends some peace, we also hope that someday we can provide resolution to the still unanswered question of where Jennifer rests. I assure you the State of Connecticut and this office will never stop looking.\"\n\nSchoenhorn said Troconis was \"devastated\" by the verdict.\n\n\"We are certain that she is innocent,\" Troconis' sister, Josie, added.\n\nBond was set at $6 million cash surety. The judge granted additional conditions requested by the state: house arrest, electronic monitoring and surrendering her passport.\n\nTroconis' sentencing is set for May 31.\n\nJennifer Dulos' mother now has custody of the five Dulos children, who were ages 8 to 13 in May 2019, according to The Associated Press.\n\nKent Mawhinney, Fotis Dulos' friend and former lawyer, is also accused of helping cover up the crime. He pleaded not guilty to conspiracy to commit murder and is awaiting trial.\n\nABC News' Jason Volack contributed to this report.", "publisher": {"href": "https://abcnews.go.com", "title": "ABC News"}}, {"title": "Driver safely removed from truck dangling above the Ohio River", "top_image": "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/LSFUGJ457VHSPAFSEA4FDFKXAI.jpg?auth=e30b70b68559997e3ca1ef0101b0829161fe55fe8978323d2585301ebc9450bf&width=1200&height=600&smart=true", "images": ["https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/OAHNE7A5C5EQXJRJEJHQUPST3E.png?auth=8bfa822c475b77a93ce34d02520af70a0c8be0849b02dc4777098b69f376a76d&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/H2FOGCP6WZCNLIPTLIWATRUTPE.png?auth=2a8979694bd5753edb1c17788061c490c36108eda647edae714841136d72478f&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/LSFUGJ457VHSPAFSEA4FDFKXAI.jpg?auth=e30b70b68559997e3ca1ef0101b0829161fe55fe8978323d2585301ebc9450bf&width=1200&height=600&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/P3AYAQCLGJE5TCUDVEKLLEZ7PM.jpg?auth=59322bbfc3a2d3d1f3025b30095ac541a20d8f6a38ce9e0127c3a00cb5293199&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/H7DQSSMKJ5DILE45LXL5T4Q7FE.jpg?auth=2005e1de117029bcb13f2cfa94e28ccbc3bde9b26488687012212251c84db098&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/PGYCGIZLVRFXLAXW6UVKB2KWCQ.png?auth=c5b61b215e19828bf7802ec711c714ebea219584016c40121a65af3aa35900ab&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F03-01-2024%2Ft_a462f3f721b548e0bbb3289caa422390_name_file_1280x720_2000_v3_1_.jpg?auth=7a5808d144379a1f3fd3edaff22324ad7d2efbc22df5d739d9eca6d4b9410cae&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/VKYDEPV35ND25GPFVVYN5N5JKU.bmp?auth=d62b845a3bece59eed6e65b9b6c2d27949affd4924b7eefafa43ce03d5a9c0e6&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/TZHXBXES45HATEPJFUVIRNZV6Y.bmp?auth=27c9eceeb767106b0266a240edde4b687d92b2849dd03c7ad46e64bbec883744&width=800&height=450&smart=true", "https://gray-wave-prod.cdn.arcpublishing.com/resizer/v2/II4VA32QVVBFZPEQXGSMY4SOLY.jpg?auth=c41b6cd05ff0040fe67b73f8074a37e7dbc063c1d7d576d9798477addd1855cc&width=800&height=450&smart=true"], "videos": [], "url": "https://www.wave3.com/2024/03/01/update-driver-removed-truck-dangling-clark-memorial-bridge/", "date": "Fri, 01 Mar 2024 17:30:00 GMT", "short_description": "Driver safely removed from truck dangling above the Ohio River  WAVE 3Semi truck hanging off Clark Memorial Bridge  WLKY LouisvilleRescue crews pull driver from semitruck hanging over Ohio River after collision on the 2nd Street Bridge  WDRBSemi dangles over side of bridge spanning Ohio River  FOX 59 IndianapolisTruck dangling from Clark Memorial Bridge  WAVE 3", "text": "LOUISVILLE, Ky. (WAVE) – First responders were able to successfully rescued the driver of a semi left dangling above the Ohio River following a crash while crossing the Clark Memorial Bridge.\n\nThe crash was reported on Friday around Noon. The semi appears to have traveling northbound when it crossed the southbound lanes through the guardrail.\n\nThe cab of the semi remained attached to the trailer but was suspended below the level of the bridge deck.\n\nChief Brian O’Neill of Louisville Fire Department said the first fire crews arrived three minutes after receiving the run. Louisville firefighters were able to talk to the semi driver. She was the only person in the cab of the vehicle. Louisville Metro police say the semi driver was taken to UofL Hospital by EMS following the extrication. LMPD says she was alert and conscious and her injuries are thought to be non-life threatening.\n\nO’Neill said firefighters developed a rescue plan to reach the driver and bring her to safety. Crews used a ladder truck to lower a first responder, LFD firefighter Bryce Carden, to the driver’s side of the rig. Carden was then able to get the driver into a harness and release her from the seatbelt. The pair were then pulled up to the bridge deck by other firefighters.\n\nIn addition to the semi, three other vehicles - two passenger vehicles and a pickup truck - were involved in the wreck. Two people in one of those vehicles were also taken to UofL Hospital. Police say their injuries are serious and appear to be life-threatening.\n\nInformation on the truck and trailer indicate they are operated by Sysco, a national food distributor and restaurant supply company with a facility in Louisville on National Turnpike.\n\nThe Clark Memorial Bridge, which carries U.S. 31 between Louisville and Jeffersonville, Indiana, remains closed to traffic while crews determine how to remove the dangling semi. Metro police say the closure will last through the afternoon rush hour and possibly into Saturday.\n\nThe crash investigation is being handled by the LMPD Traffic Unit. Engineers from the Kentucky Transportation Cabinet are also onsite to inspect the bridge once the semi has been removed.\n\nCopyright 2024 WAVE. All rights reserved.", "publisher": {"href": "https://www.wave3.com", "title": "WAVE 3"}}, {"title": "'Coward' Kevin Monahan gets decades in prison for killing Kaylin Gillis - Times Union", "top_image": "www.timesunion.com/favicon.ico", "images": [], "videos": [], "url": "https://www.timesunion.com/news/article/kevin-monahan-faces-judge-friday-driveway-murder-18695585.php", "date": "Fri, 01 Mar 2024 17:47:22 GMT", "short_description": "'Coward' Kevin Monahan gets decades in prison for killing Kaylin Gillis  Times Union ‘You just don’t get it.’ Judge admonishes NY man who fatally shot woman in his driveway and sentences him to 25 years to life  CNNKaylin Gillis' Family Slams Kevin Monahan Before He's Sentenced to Decades Behind Bars  The Daily BeastNew York man given 25 years for killing student mistakenly on his property  The Guardian USMan convicted of killing Kaylin Gillis sentenced to 25 years to life for murder  WNYT NewsChannel 13", "text": "'Coward' Kevin Monahan gets decades in prison for killing Kaylin Gillis  Times Union ‘You just don’t get it.’ Judge admonishes NY man who fatally shot woman in his driveway and sentences him to 25 years to life  CNNKaylin Gillis' Family Slams Kevin Monahan Before He's Sentenced to Decades Behind Bars  The Daily BeastNew York man given 25 years for killing student mistakenly on his property  The Guardian USMan convicted of killing Kaylin Gillis sentenced to 25 years to life for murder  WNYT NewsChannel 13", "publisher": {"href": "https://www.timesunion.com", "title": "Times Union"}}, {"title": "'Join me or I'll join you': 5 takeaways from Biden and Trump's dueling border showdown", "top_image": "https://www.gannett-cdn.com/authoring/authoring-images/2024/03/01/USAT/72797167007-combo-2.jpg?auto=webp&crop=3553,1998,x237,y0&format=pjpg&width=1200", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/authoring/authoring-images/2024/03/01/USAT/72797167007-combo-2.jpg?auto=webp&crop=3553,1998,x237,y0&format=pjpg&width=1200", "https://www.gannett-cdn.com/authoring/authoring-images/2024/03/01/USAT/72797861007-vpc-trump-biden-visit-border-getty.jpg?crop=1919,1079,x0,y0", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "videos": [], "url": "https://eu.usatoday.com/story/news/politics/elections/2024/03/01/biden-trump-border-visit-takeaways/72791846007/", "date": "Fri, 01 Mar 2024 10:19:48 GMT", "short_description": "Biden and Trump's border visit: 5 key takeaways  USA TODAYHow the Biden-Trump Border Visits Revealed a Deeper Divide  The New York TimesBiden border visit underscores Kamala Harris' shrinking role in handling migrant crisis  Fox NewsTakeaways from Biden and Trump’s dueling visits to the border  CNNWatch Biden and Trump’s border speeches on immigration, election  The Washington Post", "text": "'Join me or I'll join you': 5 takeaways from Biden and Trump's dueling border showdown\n\nShow Caption Hide Caption President Biden, former President Trump visit border in Texas President Joe Biden and former President Donald Trump visited the southern border in Texas on the same day to talk about its security.\n\nIf voters wanted an early taste of the likely election rematch between President Joe Biden and Donald Trump, they need not look further than the showdown at the U.S.-Mexico border.\n\nDuring rivaling trips to Texas 325 miles apart, Biden and Trump sparred in remarks aired within a half-hour of each other. They both took walks along parts of the border in Texas. And they took turns blaming each other in an extraordinary clash over surging migration eight months before the 2024 presidential election.\n\nPerhaps most memorably, Biden challenged Trump to get behind border legislation the former president helped kill.\n\nHere are five takeaways from the visits:\n\nBiden to Republicans: 'Show a little spine'\n\nAs expected, Biden used his visit to Brownsville, Texas, to blame congressional Republicans for inaction on the border after they blocked legislation in the Senate that would have created some of the most aggressive border restrictions in a generation.\n\nRepublicans took their cues from Trump, who urged the defeat of the bill, denying Biden a major political win in an election year.\n\n\"Both houses supported this legislation until someone came along and said, 'Don't do that, it will benefit the incumbent,'\" Biden said, referring to Trump. \"That's a hell of a way to do business in America for such a serious problem.\"\n\nThe bill would establish a new “border emergency authority,” allowing the president to temporarily prohibit individuals from seeking asylum in the U.S. when daily border crossings exceed a daily average of 4,000 in any one-week period.\n\nAmong other provisions, the bill would also fund 100 new inspection machines to detect fentanyl at the border, 1,500 Border Patrol Agents and customs officers and 4.300 new asylum officers to speed up the review of asylum claims.\n\nBiden called on congressional Republicans to \"show a little spine\" and reconsider the legislation. \"Those senators who oppose it need to set politics aside and pass it on merit, not on whether it's going to benefit one party or benefit the other party,\" Biden said.\n\nA striking split screen\n\nThe visits made for a striking split screen for a likely election rematch between Biden and Trump, who visited Eagle Pass, Texas.\n\nWhile Biden talked about bipartisanship, Trump stuck to his hardline immigration pitch that helped fuel his entry into national politics. Trump has promised the mass deportation of undocumented immigrants if he returns to the White House\n\n\"This is a Joe Biden invasion,\" Trump said, flanked by Texas Gov. Greg Abbott and Brandon Judd, the president of the National Border Patrol Council union. \"It's allowing thousands of people to come in from China, Iran, Yemen to Congo, Syria, and a lot of other nations − many nations are not very friendly to us.\"\n\nTrump said the U.S. is being overrun by \"Biden migrant crime,\" pointing above all to the death of Laken Riley, a 22-year-old nursing student whose body was found on a wooded trail at the University of Georgia. Republicans seized on the tragedy after a 26-year-old migrant from Venezuela was charged with her kidnapping and death.\n\n\"Biden will never say Laken Riley's name,\" Trump said. \"But we will say it and we will remember.\"\n\nAbbott blamed Biden for record-setting border crossings while hailing four Trump-era immigration policies: the end of \"catch and release;\" Title 42; the remain-in-Mexico policy; and border-wall spending.\n\n\"All Joe Biden had to do to secure the border was to keep in place what President Trump put in place in the first place,\" Abbott said. \"But instead, what Joe Biden did, he signed executive orders eliminating all of the effective policies that President Trump put in place.\"\n\nBiden's dare to Trump\n\nBiden, speaking from inside a Border Patrol station, only once mentioned Trump by name in his prepared remarks. It came as he called on the former president to get behind the border bill.\n\n\"I understand my predecessor is in Eagle Pass today,\" Biden said. \"Here's what I would say to Mr. Trump. Instead of playing politics with the issue, instead of telling members of Congress to block this legislation, join me or I'll join you in telling the Congress to pass this bipartisan border security bill. We can do it together.\"\n\nBiden's visit marked his most public display yet of his new get-tough strategy on immigration.\n\nAhead of the presidential election, Biden has embraced stronger rhetoric on the border, seeking authority to \"shut down\" the border when it is overwhelmed and acknowledging the border is not secure.\n\nBy killing the border bill, Republicans gave Biden an opening to go from defense to offense against Trump on the border − an issue Republicans have historically used to attack Democrats.\n\n\"You know, and I know,\" Biden said, still referring to Trump, \"it's the toughest, most efficient, most effective border security bill this country's ever seen.\"\n\nNo executive action announced\n\nBiden did not announce any executive action as he continues to mull whether to address the border unilaterally.\n\n\"The fact of the matter is that the only enduring solution is legislation,\" Homeland Security Secretary Alejandro Mayorkas told reporters during the trip. \"Actions taken outside of legislation are often met with litigation challenges in court.\"\n\nBiden has been exploring executive action under Section 212(f) of the 1952 Immigration and Nationality Act to achieve similar restrictions as the legislation on asylum-seekers trying to enter the U.S. illegally. But Biden has not made a decision or even determined whether he has the legal authority to restrict asylum-seekers.\n\nEven before any executive action is taken, progressive Democrats are pushing back, underscoring the delicate line Biden must walk as he navigates the border crisis in an election year.\n\nThe House Congressional Hispanic Caucus has said its members oppose unilateral attempts by the White House to overhaul the asylum system.\n\nWhy Brownsville?\n\nBy choosing Brownsville for his border visit, Biden did not go to the busiest stretch of the border.\n\nThat would have been Tucson, Arizona, which had 250,611 apprehensions in the area between October 2023 and January.\n\nThe Rio Grand Valley, where Brownsville is situated, had 76,436 apprehensions over the same period, making it a less active crossing site than the Eagle Pass area as well.\n\n\"He's not even going to the right place,\" Judd told The Daily Mail ahead of the visit. \"He's going to Brownsville, Texas. The Rio Grande Valley has been very slow for the past, 11, 12 months.\"\n\nBiden met with Border Patrol agents and local officials during his visit and walked with them on a gravel road looking over the border.\n\nMayorkas said Brownsville provided Biden an important glimpse into the border situation, crediting \"enhanced efforts\" by the Mexican government for the decline in migrant crossings the city is experiencing. Mayorkas said it resulted from conversations Biden and other administration officials had with Mexican President Andrés Manuel López Obrador in December.\n\nIn contrast, he said Tucson has seen an increase in border apprehensions because of patrolling difficulties in Sonora, a Mexican state directly south of Arizona.", "publisher": {"href": "https://www.usatoday.com", "title": "USA TODAY"}}, {"title": "Man served eviction papers before fatal Independence shooting lost home over taxes - Kansas City Star", "top_image": "news.google.com/favicon.ico", "images": [], "videos": [], "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LmthbnNhc2NpdHkuY29tL25ld3MvbG9jYWwvYXJ0aWNsZTI4NjEyMDkyMS5odG1s0gE7aHR0cHM6Ly9hbXAua2Fuc2FzY2l0eS5jb20vbmV3cy9sb2NhbC9hcnRpY2xlMjg2MTIwOTIxLmh0bWw?oc=5&hl=en-US&gl=US&ceid=US:en", "date": "Fri, 01 Mar 2024 16:46:10 GMT", "short_description": "Man served eviction papers before fatal Independence shooting lost home over taxes  Kansas City StarPolice officer and process server killed, 2 others shot during eviction in Independence  KMBC Kansas CityMan charged in shooting of Independence officer, process server  WDAF FOX4 Kansas CityWATCH: Man charged with murder in deaths of Independence officer, civil process server  KCTV 5Independence police officer and court official killed while serving eviction, another officer shot  KCUR", "text": "Man served eviction papers before fatal Independence shooting lost home over taxes  Kansas City StarPolice officer and process server killed, 2 others shot during eviction in Independence  KMBC Kansas CityMan charged in shooting of Independence officer, process server  WDAF FOX4 Kansas CityWATCH: Man charged with murder in deaths of Independence officer, civil process server  KCTV 5Independence police officer and court official killed while serving eviction, another officer shot  KCUR", "publisher": {"href": "https://www.kansascity.com", "title": "Kansas City Star"}}, {"title": "Biden signs stopgap bill to avert government shutdown", "top_image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t161245z-1800361495-rc2za6aspua8-rtrmadp-3-usa-shutdown.JPG?c=16x9&q=w_800,c_fill", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2010578690.jpg?c=16x9&q=h_144,w_256,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t161245z-1800361495-rc2za6aspua8-rtrmadp-3-usa-shutdown.JPG?c=16x9&q=w_800,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/2024-02-28t161245z-1800361495-rc2za6aspua8-rtrmadp-3-usa-shutdown.JPG?c=16x9&q=h_833,w_1480,c_fill"], "videos": [], "url": "https://edition.cnn.com/2024/03/01/politics/biden-signs-bill-avert-government-shutdown/index.html", "date": "Fri, 01 Mar 2024 19:12:00 GMT", "short_description": "Biden signs stopgap bill to avert government shutdown  CNN12:30 Report — Congress averts another shutdown  The HillGovernment Shutdown Averted—For Now: Biden Signs Bill Extending Budget For At Least Another Week  ForbesCongress passes short-term deal to avert partial government shutdown  USA TODAYCongress Clears Stopgap Bill to Head Off Shutdown, With Key Issues Unresolved  The New York Times", "text": "President Joe Biden on Friday signed a stopgap bill into law to avert a partial government shutdown at the end of the week.\n\nCongress had been confronting a pair of shutdown deadlines on Friday and March 8.\n\nTo provide additional time for full-year funding bills to be finalized and passed, the stopgap measure will extend funding on a short-term basis and set up two deadlines on March 8 and March 22.\n\nEarlier this week, congressional leaders announced an agreement on six appropriations bills and said the package of full-year bills will be enacted before March 8, while the remaining appropriations bills to fund the rest of the government will be finalized and passed before March 22.\n\nThe House and Senate both passed the bill on Thursday.\n\nHouse Speaker Mike Johnson has been under intense pressure from his right flank to fight for conservative wins in the government funding battle, and hardliners were quick to push back on the prospect of another short-term funding bill.\n\n“The appropriations process is ugly,” Johnson told reporters on Thursday. “Democracy is ugly. This is the way it works every year – always has – except that we’ve instituted some new innovations. We broke the omnibus fever, right? That’s how Washington has been run for years. We’re trying to turn the aircraft carrier back to real budgeting and spending reform. This was an important thing to break it up into smaller pieces.”\n\nJohnson also defended his handling of the spending talks in a meeting with GOP House members on Thursday ahead of the vote.\n\nAccording to sources in the room, Johnson said that he was forced into a position to cut the deal because GOP divisions have prevented the House from approving a procedural step, known as a rule, along party lines. That has meant he needs to rely on Democrats to pass bills with a two-thirds majority, forcing them to compromise on the spending package.\n\nJohnson won the gavel after conservatives ousted former House Speaker Kevin McCarthy in a historic vote last year, raising the question of whether the Louisiana Republican may at some point face a similar threat against his speakership.\n\nThe six bills that lawmakers have reached an agreement on and plan to pass before March 8 include funding for departments and agencies, including Agriculture-FDA; Commerce, Justice and Science; Energy and Water Development; Interior; Military Construction-Veterans Affairs; and Transportation-Housing and Urban Development.\n\nThe remaining six appropriations bills that lawmakers plan to vote on prior to March 22 including funding for Defense; Financial Services and General Government; Homeland Security; Labor-Health and Human Services; the Legislative Branch; and State and Foreign Operations.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}]}