{"count": 10, "news": [{"title": "Here's what tech giants are betting on next — from robot dogs to smartphones you can wear on your wrist", "top_image": "https://image.cnbcfm.com/api/v1/image/107380668-1709240723888-Tecno_dog.jpg?v=1709240828&w=1920&h=1080", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=1000004&cv=2.0&cj=1", "https://static-redesign.cnbcfm.com/dist/7821ea3cb72f88388591.svg", "https://image.cnbcfm.com/api/v1/image/101091331-1672755376781-Arjun_Kharpal_-_Headshot.jpg?v=1672755428&w=60&h=60&ffmt=webp", "https://image.cnbcfm.com/api/v1/image/107380668-1709240723888-Tecno_dog.jpg?v=1709240828&w=1920&h=1080", "https://static-redesign.cnbcfm.com/dist/17269f1b6083fd5f61be.svg", "https://static-redesign.cnbcfm.com/dist/2469ed0a9a4cafdf055e.svg", "https://static-redesign.cnbcfm.com/dist/09c161b9810767a7849e.svg"], "videos": [], "url": "https://www.cnbc.com/2024/03/01/latest-tech-gadgets-smart-rings-robot-dogs-bendable-phones.html", "date": "Fri, 01 Mar 2024 03:38:00 GMT", "short_description": "Here's what tech giants are betting on next — from robot dogs to smartphones you can wear on your wrist  CNBCBest gadgets I saw at MWC 2024: Smart rings, concept phones, transparent laptops  ZDNetBest of MWC 2024: Wild AI Wearables, Hyper EVs and More  CNETMWC 2024: Two Demos That Were Jaw-Droppingly Fantastic  ForbesMWC 2024: all the phones, wearables, and gadgets announced in Barcelona  The Verge", "text": "Mobile World Congress 2024, the world's biggest mobile trade show, had a lot of future-looking tech on display. Arjun Kharpal | CNBC\n\nThe Mobile World Congress, the world's largest mobile show, is a place where device makers show off some of their latest innovations. And there was quite a lot on display in Barcelona, Spain, this year.\n\nArtificial intelligence took center stage, but there was also plenty of experimentation with different types of screens and first looks at some devices from some of the world's biggest tech firms.\n\nMotorola phone that wraps around wrist\n\nMotorola showed off a concept smartphone that has the ability to bend along the spine-like hinge, including wrapping around your wrist.\n\nMotorola's \"adaptive display concept\" smartphone can wrap around a user's wrist. The phone can generate a background to match what a user is wearing. Arjun Kharpal | CNBC\n\nThe \"adaptive display concept\" smartphone from the brand, which is owned by China's Lenovo , has an interface that changes depending on how it bends. It even has a feature to generate a background to match your outfit.\n\nLenovo's see-through laptop\n\nLenovo's concept laptop has a see-through screen. Arjun Kharpal | CNBC\n\nLenovo revealed a concept laptop with a transparent screen. A company representative showed how an object could be placed behind the screen. The laptop's camera can identify it. Artificial intelligence is then used to display information about the object on the screen.\n\nExpandable smartphone\n\nThe Tecno Phantom Ultimate has a display with an expandable screen.\n\nForget foldables. It's now about rollables, according to one company. Tecno, a brand under Chinese firm Transsion, showed off the Phantom Ultimate, a phone with an expandable screen. The screen expands horizontally after it a user presses the button on the top of the device.\n\nHumane AI Pin\n\nHumane's AI Pin is equipped with a voice assistant and camera. Arjun Kharpal | CNBC\n\nThe AI Pin from a company called Humane is a small device that attaches to your clothing. You can ask it questions and it will give you a response. There's also a camera built in so it can take pictures. Here's the coolest part: The laser projector beams a menu onto your hand. You can then use hand gestures to navigate. We posted a video about it on social media here.\n\nOPPO augmented reality glasses\n\nThe Oppo Air Glass 3 is a prototype set of augmented reality glasses with a voice assistant. Oppo\n\nOppo debuted a set of augmented reality glasses it calls the Air Glass 3. The glasses are equipped with an AI assistant you can talk to.\n\nAR gaming headset\n\nCNBC's Arjun Kharpal tests out Tecno's augmented reality gaming headset. Arjun Kharpal | CNBC\n\nTecno showed off an augmented reality glasses product with a video game controller attached. It allows a user to play games on a big screen by wearing the glasses. The processing power for the whole system is housed inside the gaming controller.\n\nXiaomi phone that turns into a proper camera\n\nThe Xiaomi 14 Ultra has a \"photography kit\" that can be purchased additionally to the phone. Arjun Kharpal | CNBC\n\nXiaomi has spent years talking up its smartphones' camera capabilities. This year, the company took it one step further when it announced that it is selling a professional photography kit with its flagship Xiaomi 14 smartphone. This is a kit that attached to the smartphone and turns it into something akin to a DSLR camera.\n\nSamsung Galaxy Ring\n\nSamsung showed off the Galaxy Ring at the Mobile World Congress 2024 in Barcelona. Arjun Kharpal | CNBC\n\nSamsung introduced its Galaxy Ring this week. It's the South Korean tech giant's first foray into smart rings. It is equipped with sensors that can track things like heart rate and aspects of your sleep. Samsung said that this, combined with its smartwatch and phone, can give users some insightful health readings. The company is looking to launch it in the second half of 2024.\n\nRobot dog\n\nThe Tecno Dynamic 1 has a design inspired by a German Shepherd, according to the Chinese company. Arjun Kharpal | CNBC\n\nChinese firm Tecno showed off a robot dog. Called the Tecno Dynamic 1, it has a design inspired by a German Shepherd, according to the company. In a demo, the dog danced to a beat, jumped around and shook hands with a person. Other companies like Xiaomi are also developing robot dogs.\n\nXiaomi SU7\n\nThe Xiaomi SU7 on display at the Mobile World Congress 2024. Arjun Kharpal | CNBC", "publisher": {"href": "https://www.cnbc.com", "title": "CNBC"}}, {"title": "Kingdom Hearts Surfaces to Celebrate Launch of Final Fantasy 7 Rebirth", "top_image": "https://images.pushsquare.com/75a24a84f05da/1280x720.jpg", "images": ["https://static.pushsquare.com/themes/base/images/flags/us.gif", "https://images.pushsquare.com/site/logo.svg", "https://images.pushsquare.com/systems/ps5/cover_small.jpg", "https://static.pushsquare.com/themes/ps.v4/images/avatar.jpg", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCA3NSA3NSI+PC9zdmc+", "https://static.pushsquare.com/themes/base/images/flags/eu.gif", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxMzAgMTAwIj48L3N2Zz4=", "https://static.pushsquare.com/themes/ps.v4/images/ps-plus.png", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCA5MDAgNTA2Ij48L3N2Zz4=", "https://images.pushsquare.com/75a24a84f05da/1280x720.jpg", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxNTAgOTAiPjwvc3ZnPg==", "https://b.scorecardresearch.com/p?c1=2&c2=8518622&cv=2.0&cj=1", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCA4MCA4MCI+PC9zdmc+", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAzMCAzMCI+PC9zdmc+"], "videos": [], "url": "https://www.pushsquare.com/news/2024/03/kingdom-hearts-surfaces-to-celebrate-launch-of-final-fantasy-7-rebirth", "date": "Fri, 01 Mar 2024 03:00:00 GMT", "short_description": "Kingdom Hearts Surfaces to Celebrate Launch of Final Fantasy 7 Rebirth  Push SquareDefinitely don't start your Final Fantasy VII experience with Rebirth  The VergeFF7 Rebirth Walkthrough - Final Fantasy 7 Rebirth Guide  IGNFF7 Rebirth Keeps The Janky Goodness Of The Original Game  KotakuFinal Fantasy 7 Rebirth Ending Explained  GameRant", "text": "Sora, the spiky-haired protagonist of Square Enix's Kingdom Hearts series, has briefly surfaced to congratulate fellow spiky-haired protagonist, Cloud Strife, on the (largely) successful launch of Final Fantasy VII Rebirth.\n\nThis is a cute thing that Twitter accounts will occasionally do, especially when operated by the same publisher. Still, we have to say, that apocalyptic vision of Tokoyo's Shibuya Crossing with Sepiroth emblazoned on every screen? Pretty sick. We've heard virtually nothing about Kingdom Hearts IV since it was revealed back in 2022. Still, The concept of Sora and the Heartless crossing over into a modern realm inspired by our own is intriguing, and we'll be fascinated to see it implemented and put into action.", "publisher": {"href": "https://www.pushsquare.com", "title": "Push Square"}}, {"title": "Spotify, Epic Games and others pen letter to EC, claiming Apple has made a ‘mockery’ of the DMA", "top_image": "https://techcrunch.com/wp-content/uploads/2024/02/apple-ghost-logo.jpg?resize=1200,675", "images": ["https://techcrunch.com/wp-content/uploads/2024/02/apple-ghost-logo.jpg?w=711", "https://techcrunch.com/wp-content/uploads/2024/02/apple-ghost-logo.jpg?resize=1200,675"], "videos": [], "url": "https://techcrunch.com/2024/03/01/spotify-epic-games-and-others-pen-letter-to-ec-claiming-apple-has-made-a-mockery-of-the-dma/", "date": "Fri, 01 Mar 2024 18:19:19 GMT", "short_description": "Spotify, Epic Games and others pen letter to EC, claiming Apple has made a ‘mockery’ of the DMA  TechCrunchNumber of agencies have concerns about 'sideloading' on iPhone, Apple says  ReutersNow Apple says it won't disable iPhone web apps in the EU  The VergeApple on why many agencies are worried about EU rules for iPhones coming into effect from March 7  The Times of IndiaA Letter to the European Commission on Apple's Lack of DMA Compliance — Spotify  For the Record", "text": "Epic Games, Spotify, Proton, 37signals and other developers had already signaled their displeasure with how Apple has chosen to adapt its rules to meet the requirements of the new EU regulation, the Digital Markets Act (DMA), calling it “extortion” and “bad-faith” compliance, among other things. Now those companies have formalized their complaints in a letter addressed to the European Commission, where they collectively argue that Apple has made a mockery of the new law and urge the EC to take “swift, timely, and decisive action against Apple” in order to protect developers.\n\nApple’s new DMA rules have been widely criticized by developers and tech companies, including Meta, Mozilla and Microsoft. Instead of introducing a new, more level playing field where developers could easily compete with Apple’s App Store, Apple found a way to legally comply with the specifics of the regulation, but not its intention. Most notably, it introduced a Core Technology Fee for those developers adopting its DMA rules, which requires apps distributed outside the App Store to still pay Apple €0.50 for each first annual install per year over a 1 million threshold. This was bad news for would-be rivals that had wanted to set up their own app stores or distribute their apps outside of Apple’s walls to avoid paying commissions.\n\nIn the new letter, 34 companies and associations across a variety of sectors are asking the EC to take action.\n\n“Apple’s new terms not only disregard both the spirit and letter of the law, but if left unchanged, make a mockery of the DMA and the considerable efforts by the European Commission and EU institutions to make digital markets competitive,” it reads.\n\nThe letter goes on to point out where the companies think that Apple is non-compliant with the DMA, noting that Apple’s system of requiring developers to choose to opt into the DMA terms adds unnecessary complexity and confusion, as both are non-compliant, it says. Plus, because of the new fee structure, and the Core Technology Fee, it’s clear that few will agree to the DMA terms, the companies said. While there has been much vocal criticism of the terms, at least one developer, MacPaw, recently announced it had accessed the terms to distribute its software subscription Setapp in the EU.\n\nThe companies also complain that Apple’s “scare screens,” designed to warn customers of the risks associated with transacting outside Apple’s App Store, will “mislead and degrade the user experience, depriving them of real choice and the benefits of the DMA.”\n\nFinally, the letter argues that for the DMA to be effective, it needs to allow for alternative app stores and sideloading — the former which the companies say Apple makes difficult and the latter which Apple’s DMA rules don’t even allow for.\n\nApple, meanwhile, also published a whitepaper today that outlines its solutions to address the changes the DMA requires to commissions and payments. Here, it stresses the security and trust customers have with Apple and its emphasis on consumer privacy. In short, its position is that “Users should not be exposed to physical harm through iOS,” and that all its efforts with regard to DMA compliance are means of reducing any potential harms that users could be exposed to.\n\nThere are hints that Apple may be feeling the pressure, however, as it also today reversed an earlier decision to block progressive web apps from operating normally on devices in the EU. The FT had recently reported that the EC’s ruling focused on competition in the streaming music market will not be in Apple’s favor and will rather extract a €500 million fine from the iPhone maker. Apple responded to this by sharing details about Spotify’s success on iOS, noting that its app had been installed more than 119 billion times across Apple devices, among other things.\n\nIn response to the companies’ letter, an EC spokesperson told TechCrunch that the six-month deadline for Big Tech gatekeepers, like Apple, was there for a reason.\n\n“Once the compliance solutions are fully known next week, these need to be properly analyzed both by the Commission and stakeholders, in its completeness and not just based on a few announcements,” they noted, adding that the Commission is looking “very carefully” at how companies are complying.\n\nOnce it has full enforcement powers, the EC will “not hesitate to act,” they also said.", "publisher": {"href": "https://techcrunch.com", "title": "TechCrunch"}}, {"title": "Spotify’s new audiobook tier will only save you a dollar over Premium", "top_image": "https://cdn.vox-cdn.com/thumbor/0yqcZUaFgtYFDr7BbChGXEx_qEY=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951390/STK088_VRG_Illo_N_Barclay_5_spotify.jpg", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://duet-cdn.vox-cdn.com/thumbor/0x0:2040x1360/2400x2400/filters:focal(1020x680:1021x681):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/22953861/IMG_0049_2.jpg", "https://duet-cdn.vox-cdn.com/thumbor/0x0:2000x1333/2400x2400/filters:focal(1000x667:1001x668):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/25304628/DSC06782_processed.jpg", "https://duet-cdn.vox-cdn.com/thumbor/0x0:2040x1360/2400x1600/filters:focal(1020x680:1021x681):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951390/STK088_VRG_Illo_N_Barclay_5_spotify.jpg", "https://news.google.com/icons/native-ad-placeholder.png", "https://duet-cdn.vox-cdn.com/thumbor/0x0:4375x2916/2400x2400/filters:focal(2188x1458:2189x1459):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/25313069/1441734796.jpg", "https://cdn.vox-cdn.com/thumbor/0yqcZUaFgtYFDr7BbChGXEx_qEY=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951390/STK088_VRG_Illo_N_Barclay_5_spotify.jpg", "https://duet-cdn.vox-cdn.com/thumbor/0x0:2040x1360/2400x2400/filters:focal(1020x680:1021x681):format(webp)/cdn.vox-cdn.com/uploads/chorus_asset/file/24974621/STK088_VRG_Illo_N_Barclay_1_spotify.jpeg"], "videos": [], "url": "https://www.theverge.com/2024/3/1/24087550/spotify-audiobook-access-tier-price-ads", "date": "Fri, 01 Mar 2024 16:28:44 GMT", "short_description": "Spotify's new audiobook tier will only save you a dollar over Premium  The VergeSpotify's New Audiobooks Access Tier Gives Booklovers More Listening Options — Spotify  For the RecordSpotify rolls out an audiobook-only subscription  EngadgetSpotify launches a $9.99/mo standalone audiobooks service for its free users  TechCrunchSpotify adds a paid audiobook option to its free tier  Digital Trends", "text": "Spotify announced a new subscription tier that “gives booklovers more listening options.” But subscribers would only save $1 a month compared to the classic Premium tier.\n\nThe monthly subscription costs $9.99 and includes 15 free listening hours of audiobooks, the same as the classic Premium plan. But $10.99 Premium subscribers get 15 hours of audiobooks, plus ad-free music and podcasts — whereas the audiobook plan still has ads for music and podcast services. Essentially, audiobook listeners are paying nearly the same amount while getting half the benefits.\n\nThe audiobook plan also doesn’t add any additional perks for readers. If I were a big audiobook person, I’d probably want more than 15 hours a month, for example. But Spotify is capping the listening limit for Premium subscribers and the book lovers option. For $12.99, subscribers can buy 10 extra hours of books if they run out between billing cycles. The new tier almost feels like it’s simply upselling potential subscribers to the regular Premium option, instead of encouraging people who love audiobooks to subscribe for that service.\n\nOne benefit could be Spotify’s library of options. Audible’s basic plan, priced at $7.95 a month, only covers a selection of audiobooks, compared to the 200,000 titles Spotify is opening up. On the other hand, Audible allows for unlimited listening. A higher priced Audible tier at $14.95 includes unlimited listening to the basic plan library, plus one credit a month to purchase any book that you get to keep.\n\nFor months, anger has been brewing in publishing about Spotify’s treatment of audiobooks, especially around compensation. Some publishers like Macmillan told writers that royalty payments will only apply for each full listen of their book, according to Bloomberg — one person listening to a full 10-hour-long audiobook or two people each listening to five hours, for example. This is different from other models, where authors are paid for purchases of their titles, regardless of how much the listener consumes. Bloomberg notes that different publishing houses may have different terms with Spotify.", "publisher": {"href": "https://www.theverge.com", "title": "The Verge"}}, {"title": "All-Time Low: AirPods Pro 2 Get $60 Discount at Amazon", "top_image": "https://www.cnet.com/a/img/resize/1f4d59ae8f338b3485df60b0b62871830fd17b44/hub/2023/11/11/b308bc69-332f-43e6-8da3-e926ef79c9a6/artboard-7-3.png?auto=webp&fit=crop&height=675&width=1200", "images": ["https://www.cnet.com/a/img/resize/699a37ce860cb162c0e6743c87e9cf03185f6a68/hub/2023/08/22/ee43218a-f9ae-4d3a-8722-0331bd61ccc5/profile.png?auto=webp&fit=crop&height=96&width=96", "https://www.cnet.com/a/img/resize/6d2e48ba4b3468bf7138c9be3775074b354a523e/hub/2022/11/16/0234efad-5341-4fab-aaac-bd77416ac5f6/airpodspro2.jpg?auto=webp&width=768", "https://www.cnet.com/a/img/resize/025ba115ca05aaba4b6d25727831e8496307ce3f/hub/2022/06/28/c697fea3-2f4e-4b60-acc4-a93952f2bb92/cnet-shopping-image-gallery-16x9-1920x1080-r1-tech-a.png?auto=webp&fit=crop&height=108&width=196", "https://www.cnet.com/a/img/resize/1f4d59ae8f338b3485df60b0b62871830fd17b44/hub/2023/11/11/b308bc69-332f-43e6-8da3-e926ef79c9a6/artboard-7-3.png?auto=webp&fit=crop&height=675&width=1200", "https://www.cnet.com/a/neutron/images/logos/cnet-short.png", "https://www.cnet.com/a/img/resize/156932e793b5f9a18830535ceb711d54b6261b22/hub/2023/11/11/b308bc69-332f-43e6-8da3-e926ef79c9a6/artboard-7-3.png?auto=webp&fit=crop&height=360&width=640", "https://www.cnet.com/a/img/resize/c80a5793ead815fe4af1447c19c56f3ae4ff0987/hub/2023/08/22/ee43218a-f9ae-4d3a-8722-0331bd61ccc5/profile.png?auto=webp&fit=crop&height=84&width=84"], "videos": [], "url": "https://www.cnet.com/deals/all-time-low-airpods-pro-2-get-60-discount-amazon/", "date": "Fri, 01 Mar 2024 14:08:00 GMT", "short_description": "All-Time Low: AirPods Pro 2 Get $60 Discount at Amazon  CNETApple headphones are $69 off in every color at Amazon today  SFGATESave $50 Off a Brand New Pair of Apple AirPods Pro  IGNApple AirPods drops to ‘lowest-ever’ price, no conditions applied  The Times of India'Nothing short of exceptional': The Airpods Pro 2 are 25% off — snap them up for $199  Yahoo! Voices", "text": "Whether you're in need of a new pair of wireless earbuds to pair with your iPhone or you want to upgrade to the best AirPods to use with Apple's Vision Pro, the latest AirPods Pro 2 are definitely the best option -- and the only option if you want to get the most out of your new Apple headset. Not only are they the only earbuds that offer lossless audio support when using Apple's brand-new mixed reality headset, but they offer some of the best noise-canceling capabilities you're likely to find as well.\n\nRight now you can snag a set for just $189 at Amazon -- a $60 savings -- with Walmart also matching the deal. That drops Apple's latest buds down to a record-matching low price. There's no word on how long this deal will last, so we recommend nabbing a set at this price whil you can if you're interested.\n\nWatch this: AirPods Pro 2: After 2 Months, They're Still Great 09:53\n\nThe AirPods Pro 2 also sport Apple's Transparency Mode for when you need to be more aware of your surroundings and they'll automatically optimize their volume based on your environment to boot. This upgraded pair not only offers Qi wireless charging but also USB-C wired charging for those times when you need the quickest charging possible. In use, the earbuds promise an impressive battery life of up to 30 hours on a single charge when paired with the charging case. They also instantly pair and switch between Apple devices, making these wireless earbuds a joy to use for those in the Apple ecosystem.\n\nFor the Vision Pro specifically, the USB-C AirPods Pro 2 offer support for 20-bit/48 kHz Lossless Audio with ultralow latency. The Apple Vision Pro has its own built-in speakers so AirPods aren't an essential add-on, but they do allow for a more immersive -- and private -- viewing experience if you want to lose yourself in a movie.\n\nNot into Apple's buds or looking for headphones instead? There are tons of headphone and earbud deals available right now.", "publisher": {"href": "https://www.cnet.com", "title": "CNET"}}, {"title": "Apple may soon be feeling the heat from investors over its slow rollout of buzzy AI products", "top_image": "https://i.insider.com/65e07870ce7f1785b2e4d75d?width=1200&format=jpeg", "images": ["https://news.google.com/public/assets/BI/US/logos/newsletters/insider-today-logo.png", "https://news.google.com/public/assets/shared/light-switch.png", "https://news.google.com/public/assets/BI/DE/logos/BI-DE-Black-on-Light-final-footer-logo-opt.svg", "https://news.google.com/public/assets/BI/US/icons/twitter.svg", "https://news.google.com/public/assets/BI/US/icons/instagram.svg", "https://i.insider.com/65437fd93cc84b4dfafa9dd1?width=700", "https://news.google.com/public/assets/BI/US/icons/linkedin.svg", "https://i.insider.com/597b4359b50ab12a008b53fa?width=1280&height=866&format=jpeg&auto=webp", "https://news.google.com/public/assets/subscription/marketing/banner-overlay/top-left.svg", "https://news.google.com/public/assets/logos/stacked-black.svg", "https://news.google.com/public/assets/BI/US/icons/facebook.svg", "https://news.google.com/public/assets/subscription/marketing/banner-overlay/bottom-right.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=9900186&cv=3.6.0&;cj=1&comscorekw=artificial-intelligence", "https://news.google.com/public/assets/badges/google-play-badge.svg", "https://news.google.com/public/assets/BI/US/logos/Tech-Insider-opt.svg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://news.google.com/public/assets/INSIDER/US/logos/insider-inc.svg", "https://news.google.com/public/assets/badges/app-store-badge.svg", "https://news.google.com/public/assets/shared/privacy-options.svg", "https://i.insider.com/65e07870ce7f1785b2e4d75d?width=1200&format=jpeg", "https://news.google.com/public/assets/INSIDER/US/logos/Insider-logo-dark-opt.svg", "https://news.google.com/public/assets/rebrand/newsletter-bull.png", "https://news.google.com/public/assets/INSIDER/US/logos/insider-com-trademark-opt.svg", "https://news.google.com/public/assets/BI/US/icons/youtube.svg"], "videos": [], "url": "https://www.businessinsider.com/apple-investors-ai-race-tim-cook-2024-2?r=US&IR=T", "date": "Fri, 01 Mar 2024 09:00:00 GMT", "short_description": "Apple faces heat from investors over slow AI development  Business InsiderApple faces the most disruptive threat it has seen in the iPhone era  Financial TimesApple's Launching A Futuristic Siri And Apple-Based Artificial Intelligence As It Looks To Take On Microsoft's AI Dominance  Yahoo FinanceApple CEO Tim Cook says company is 'investing significantly' in generative AI  CNBCApple Shareholders Reject AI Report Proposal - WSJ  The Wall Street Journal", "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nApple is moving more slowly on developing generative-AI products than some of its Big Tech peers, leaving investors wondering when, or if, it will go all in on the technology.\n\nBrian Mulberry, a portfolio manager at the Apple shareholder Zacks Investment Management, told The Wall Street Journal the company hadn't really made a \"big splash in the AI space yet.\"\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nHe said: \"AI is what most investors are really excited about. Almost all momentum in the market in general is being fueled by AI.\"\n\nAfter being spurred on by eager investor interest, companies such as Google, Microsoft, and Meta have been pushing out buzzy artificial-intelligence products at pace. But Apple has yet to make any major announcements.\n\nAdvertisement\n\nApple CEO Tim Cook has, however, been eager to reassure shareholders that the company is big on AI.\n\nAt the company's annual shareholder meeting on Wednesday, Cook said the firm had been innovating in AI for years and was \"currently investing significantly in this area.\"\n\nThe CEO said he saw incredible \"breakthrough potential\" for the tech, adding that it would unlock \"transformative opportunities\" for users, according to Reuters. He also said there was \"no better computer for AI\" than the Apple Mac.\n\nWhile Cook said he wasn't ready to give more details on Apple's AI development, he told shareholders the company would disclose its plans later this year, Reuters reported.\n\nAdvertisement\n\nDavid Wagner, a portfolio manager at the Apple shareholder Aptus Capital Advisors, told the Journal that while AI was \"the topic du jour,\" the market tended to be driven by narrative.\n\n\"Everybody is clamoring for Apple to have a story,\" he told the news outlet.\n\nRepresentatives for Apple didn't immediately respond to a request for comment from Business Insider, made outside normal working hours.\n\nAt the Wednesday meeting, Apple shareholders also voted down a request for an AI-transparency report. The report, backed by Apple's labor force, would have delved into the ethics of how the company was using AI, Bloomberg reported.", "publisher": {"href": "https://www.businessinsider.com", "title": "Business Insider"}}, {"title": "Here Come the AI Worms", "top_image": "https://media.wired.com/photos/65e0e13fef1050f96f06c160/191:100/w_1280,c_limit/security_ai_worm_email_spam.jpg", "images": ["https://media.wired.com/photos/65de723e40f090f1300f8517/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/635b0596a398fb738c4b924f/1:1/w_270%2Cc_limit/undefined", "https://media.wired.com/photos/65e0e13fef1050f96f06c160/master/w_2560%2Cc_limit/security_ai_worm_email_spam.jpg", "https://media.wired.com/photos/65e0b253054e55cd02eaf84d/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65e0e13fef1050f96f06c160/191:100/w_1280,c_limit/security_ai_worm_email_spam.jpg", "https://media.wired.com/photos/65de772721aac0c076d9a318/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://news.google.com/verso/static/wired/assets/logo-reverse.svg", "https://media.wired.com/photos/65dfc6054f673424018eca12/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65ce8e802d03fe069d2dde96/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://news.google.com/verso/static/wired/assets/logo-header.svg", "https://media.wired.com/photos/65df89490a712b35e09d1355/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65de3f5c8f177b35ceaa4d78/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65dcd3aeca2194c4e2e5c3e8/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65df8a8a4f673424018eca0d/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.wired.com/photos/65d6a25352ec931ba5079b5b/16:9/w_800%2Ch_450%2Cc_limit/undefined"], "videos": [], "url": "https://www.wired.com/story/here-come-the-ai-worms/", "date": "Fri, 01 Mar 2024 09:00:00 GMT", "short_description": "Here Come the AI Worms  WIRED", "text": "As generative AI systems like OpenAI's ChatGPT and Google's Gemini become more advanced, they are increasingly being put to work. Startups and tech companies are building AI agents and ecosystems on top of the systems that can complete boring chores for you: think automatically making calendar bookings and potentially buying products. But as the tools are given more freedom, it also increases the potential ways they can be attacked.\n\nNow, in a demonstration of the risks of connected, autonomous AI ecosystems, a group of researchers have created one of what they claim are the first generative AI worms—which can spread from one system to another, potentially stealing data or deploying malware in the process. “It basically means that now you have the ability to conduct or to perform a new kind of cyberattack that hasn't been seen before,” says Ben Nassi, a Cornell Tech researcher behind the research.\n\nNassi, along with fellow researchers Stav Cohen and Ron Bitton, created the worm, dubbed Morris II, as a nod to the original Morris computer worm that caused chaos across the internet in 1988. In a research paper and website shared exclusively with WIRED, the researchers show how the AI worm can attack a generative AI email assistant to steal data from emails and send spam messages—breaking some security protections in ChatGPT and Gemini in the process.\n\nThe research, which was undertaken in test environments and not against a publicly available email assistant, comes as large language models (LLMs) are increasingly becoming multimodal, being able to generate images and video as well as text. While generative AI worms haven’t been spotted in the wild yet, multiple researchers say they are a security risk that startups, developers, and tech companies should be concerned about.\n\nMost generative AI systems work by being fed prompts—text instructions that tell the tools to answer a question or create an image. However, these prompts can also be weaponized against the system. Jailbreaks can make a system disregard its safety rules and spew out toxic or hateful content, while prompt injection attacks can give a chatbot secret instructions. For example, an attacker may hide text on a webpage telling an LLM to act as a scammer and ask for your bank details.\n\nTo create the generative AI worm, the researchers turned to a so-called “adversarial self-replicating prompt.” This is a prompt that triggers the generative AI model to output, in its response, another prompt, the researchers say. In short, the AI system is told to produce a set of further instructions in its replies. This is broadly similar to traditional SQL injection and buffer overflow attacks, the researchers say.\n\nTo show how the worm can work, the researchers created an email system that could send and receive messages using generative AI, plugging into ChatGPT, Gemini, and open source LLM, LLaVA. They then found two ways to exploit the system—by using a text-based self-replicating prompt and by embedding a self-replicating prompt within an image file.", "publisher": {"href": "https://www.wired.com", "title": "WIRED"}}, {"title": "Windows includes built-in ransomware protection. Here’s how to turn it on", "top_image": "https://www.pcworld.com/wp-content/uploads/2024/03/Antivirus-Ed-Hardie-Unsplash-1.jpg?quality=50&strip=all&w=1024", "images": ["https://www.pcworld.com/wp-content/uploads/2024/03/Antivirus-Ed-Hardie-Unsplash-1.jpg?quality=50&strip=all&w=1024", "https://b2c-contenthub.com/wp-content/uploads/2024/02/image_47e15e.png?w=1200", "https://www.pcworld.com/wp-content/uploads/2021/09/thumbnail_pcworld-wp-footer-promo.png ", "https://www.pcworld.com/wp-content/uploads/2024/03/ay_idg_byline2-100779100-orig-4.png?w=150", "https://www.pcworld.com/wp-content/uploads/2024/03/ay_idg_byline2-100779100-orig-4.png?w=150&h=150&crop=1", "https://b2c-contenthub.com/wp-content/uploads/2023/12/IMG_3647-sm.jpg?quality=50&strip=all", "https://b2c-contenthub.com/wp-content/uploads/2024/02/image_263831.png?w=1200"], "videos": [], "url": "https://www.pcworld.com/article/2245853/how-to-turn-on-windows-ransomware-protection.html", "date": "Fri, 01 Mar 2024 11:30:00 GMT", "short_description": "Windows includes built-in ransomware protection. Here's how to turn it on  PCWorld", "text": "Ransomware is nasty stuff. This type of malware encrypts files on your PC so that you can’t access them—unless you must pay the attacker to unlock the data. In other words, your files are held hostage until you cough up the demanded ransom.\n\nThe best defense against ransomware is avoiding sites and downloads riddled with it, but you can take other protective measures, too. Modern antivirus software often restrict which apps can change files in folders commonly targeted by ransomware. Microsoft Defender, which is built into Windows, can do this too. (Microsoft changed the name from Windows Defender several years ago, but it’s the same program.) Some antivirus suites also run automatic backups, in case you need to restore your files.\n\nThe catch? Unlike third-party antivirus software, these extra safeguards are not turned on by default in Microsoft Defender. You have to enable them yourself.\n\nHow to turn on ransomware protection in Windows\n\nStep One: Open Windows Security\n\nOpen the Windows Security app on your PC. You can access it in one of several ways:\n\nPress Alt + Spacebar on your keyboard, type in windows security, then hit Enter\n\nOpen your Start Menu and type in windows security, then press Enter\n\nOpen your Settings app, then choose Windows Security in the left pane\n\nStep Two: Find your ransomware settings\n\nIn the Windows Security app, click on Virus & threat protection. Then click Manage ransomware protection at the bottom of the screen.\n\nNext, turn on Controlled folder access. This setting restricts app access to your PC’s default OneDrive, Documents, Pictures, Videos, Music, and Favorites folders. You can also manually add other folders to the list.\n\nNot all apps will be barred from these areas in Windows—Microsoft Office programs are automatically allowed to open and alter files. But if it’s not on Microsoft’s internal list of trusted apps, a program can’t see anything in those folders until explicit permission is granted in Windows Security.\n\nStep three: Make sure you’re logged into OneDrive\n\nLimiting access to files and folders won’t completely protect them. Another important method of defense is to have good backups—which Windows automatically does if you’re logged into OneDrive. (You can either connect a Microsoft account to your whole Windows PC, or just the OneDrive app specifically.)\n\nTo confirm that this protection is on, you can look at Ransomware protection > Ransomware data recovery.\n\nOf course, for the purpose of warding off ransomware’s worst effects, the safest backup of your files is the one you keep offline. You should make one in addition to anything stored in the cloud—if you only have one copy of your data, you’re not properly backed up after all.\n\nShould you turn on ransomware protection in Windows?\n\nSecurity and convenience live on opposite ends of a spectrum, and that’s the case here, too. Controlling folder access in Windows can keep attackers out of your important folders, but it can also be slightly inconvenient. Gamers, for example, may find that access to save files might be blocked by default, as they’re often saved in your Documents folder.\n\nYou can solve this problem with minimal work—add the app to the access list. Or save game files to a different folder on your PC that does not have controlled access to it. (You’ll just have to use third-party software to set up a schedule for regular backups.)\n\nOUr CURRENT PICK FOR BEST ANTIVIRUS SOFTWARE Norton 360 Deluxe Read our review Best Prices Today:\n\nProtect your Windows PC from other online threats, too\n\nFor more information about Windows Security (and its different components), you can check out our video overview on YouTube. If you prefer more sophisticated software, plus additional protections, you can also look into upgrading your antivirus software. For example, Norton 300 Deluxe, our current top pick for antivirus, bundles strong malware protection with a VPN, password manager, dark web monitoring for your personal data, and more. It can help simplify staying safer online.", "publisher": {"href": "https://www.pcworld.com", "title": "PCWorld"}}, {"title": "Groom wears Apple Vision Pro on his wedding day as wife is creeped out: ‘Her face says it all’", "top_image": "https://nypost.com/wp-content/uploads/sites/2/2024/03/Vision-pro-1.jpg?quality=75&strip=all&w=1024", "images": ["https://nypost.com/wp-content/uploads/sites/2/2024/02/77413042-1.jpg?quality=75&strip=all&w=260&h=174&crop=1", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://sb.scorecardresearch.com/p?c1=2&c2=6390601&c3=NYPOST&cj=1&cv=3.6", "https://nypost.com/wp-content/uploads/sites/2/2024/03/77465893-1.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/meta-1.jpg?w=808", "https://nypost.com/wp-content/uploads/sites/2/2024/02/wayfair72feat_478692.jpg?quality=75&strip=all&w=93&h=62&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2024/03/shutterstock_editorial_Daily_Life_New_York_USA_14331031aa.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/meta-2.jpg?w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/02/77413042-1.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/mu-plugins/vip-helpers/images/vip-powered-dark-small.png", "https://nypost.com/wp-content/uploads/sites/2/2024/02/77412658.jpg?quality=75&strip=all&w=260&h=174&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2024/02/boots-feature.jpg?quality=75&strip=all&w=93&h=62&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2024/01/duvet.jpg?quality=75&strip=all&w=93&h=62&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2024/03/meta-2.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/02/amazon-prime-day-24.jpg?quality=75&strip=all&w=93&h=62&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2024/02/miami-beach-florida-veterans-day-77425623.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/meta-1.jpg?quality=75&strip=all&w=808", "https://nypost.com/wp-content/uploads/sites/2/2024/03/tech-worker-sparks-brides-fury-77456446.jpg?w=768", "https://nypost.com/wp-content/uploads/sites/2/2024/02/books.jpg?quality=75&strip=all&w=93&h=62&crop=1", "https://pagesix.com/wp-content/uploads/sites/3/2024/03/77480986.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/Vision-pro-1.jpg?quality=75&strip=all&w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/newspress-collage-94h7yfj9l-1709308388281.jpg?quality=75&strip=all&1709290428&w=260&h=174&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2023/02/button_3_bg-2.png?w=206", "https://nypost.com/wp-content/uploads/sites/2/2024/03/shutterstock_editorial_Daily_Life_New_York_USA_14331031aa.jpg?w=1024", "https://nypost.com/wp-content/uploads/sites/2/2024/03/tech-worker-sparks-brides-fury-77456446.jpg?quality=75&strip=all&w=768"], "videos": [], "url": "https://nypost.com/2024/03/01/lifestyle/california-groom-jacob-wright-wears-apple-vision-pro-at-wedding-creeps-out-wife-cambree/", "date": "Fri, 01 Mar 2024 08:50:00 GMT", "short_description": "Groom wears Apple Vision Pro on his wedding day as wife is creeped out: 'Her face says it all'  New York Post Tech worker wore an Apple Vision Pro at his wedding  MashableGroom Wears Apple Vision Pro VR Headset in Wedding Photos  TODAYUS Groom Sports \"Creepy\" Apple Vision Pro At Wedding, Bride Unimpressed  NDTVWe Talked to the Guy Who Wore a Vision Pro VR Headset at His Wedding  Futurism", "text": "A California software engineer infuriated his new wife when he sported his Apple Vision Pro headset during their wedding day.\n\nJacob Wright, a tech engineer for a start-up AI company, wore the $3,500 headset alongside his elegant bride, Cambree, in front of a scenic Utah mountain range as the couple celebrated their nuptials on Feb. 10.\n\nIn the couple’s wedding photos, Cambree Wright shot a disgusted look as she held her flower bouquet while the tech worker was seemingly in his world.\n\n“I try not to look because it’s a little creepy, it’s a little uncanny,” Cambree said to SFGATE. “When he’s in the Apple Vision Pro, I let him do his thing.”\n\nThe Apple Vision Pro is a virtual reality headset that can display digital content within a person’s physical space.\n\n4 Jacob Wright extends his hand out to seemingly use a control panel on his Apple Vision Pro headset, while his wife looks in disgust. @jason, /X\n\nWhen wearing the Apple headset, a user can navigate by using their voice, hands, and of course, eyes.\n\nAt one point, Cambree said she had to guard Wright’s headset during the photoshoot because she was afraid Wright would try to wear it during the actual wedding ceremony.\n\n4 Cambree says she tries not to look at Wright when he has on the headset because it’s “creepy and “a little uncanny.” @jason, /X\n\nWright, who bought the headset days after it was released, desperately asked Cambree if he could wear it during their ceremony.\n\nShe struck down his request – only allowing him to wear it at the reception.\n\n“He’s like, ‘Hey baby, can we get pictures with the Apple Vision Pro?’” Cambree recalled.\n\n“He probably asked me two or three times. I was like, ‘No, no, no, we have to wait, we have to wait.’ And then I turn around one minute and he has it on,” she added.\n\n4 Jacob Wright dances at the reception with his bride — and his headset. @jahvascript / X\n\nJacob Wright then hit the dancefloor fully equipped with the white, 2-pound headset strapped to his face.\n\n“I have a video of me there with all the bridesmaids, all the groomsmen — everyone who came to the ceremony,” he told Futurism. “I think that’ll be super awesome to show our kids in 20 years,”\n\n4 The Apple Vision Pro is a virtual reality headset that displays digital content within a person’s physical space. Erik Pendzich/Shutterstock\n\nWright faced intense backlash over his decision to wear the headset during his special day.\n\n“What’s the return policy on Husbands?” one person joked on X.\n\n“The divorce papers are already happening,” another jokester commented.\n\n“Her face says it all,” a third person said, referring to Cambree’s expression.\n\n“Just finishing the Pre Nup… real quick and we should be good… And done. Yes, I Do!,” someone said, referring to Wright’s hand placement in the wedding photo.\n\nSince its release last month, the Apple Vision Pro has gained fast traction in the tech world, but not necessarily for the right reasons.\n\nLast week, San Diego police issued a warning after catching a pedestrian crossing the street with the headset strapped to his face.\n\nFootage showed the person crossing the street while they seemingly accessed a virtual menu by using their hands, as a police officer was arresting another person on the corner.", "publisher": {"href": "https://nypost.com", "title": "New York Post"}}, {"title": "New report confirms Samsung Unpacked in early to mid July, points at Paris as location", "top_image": "https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-fold6-first-renders/-952x498w6/gsmarena_001.jpg", "images": ["https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-flip6-renders/-184x111/gsmarena_000.jpg", "https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-fold6-titanium/-184x111/gsmarena_000.jpg", "https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-fold6-first-renders/-952x498w6/gsmarena_001.jpg", "https://st.arenaev.com/i/logo/arenaevcolor-neg.svg", "https://fdn.gsmarena.com/imgroot/news/24/01/galaxy-z-flip6-bigger-battery/-184x111/gsmarena_000.jpg", "https://fdn2.gsmarena.com/w/css/logo-gsmarena-com.png", "https://st.arenaev.com/news/24/03/toyota-talks-tough-on-evs/-344x215/arenaev_001.jpg", "https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-fold6-first-renders/-184x111/gsmarena_001.jpg", "https://fdn.gsmarena.com/imgroot/news/24/02/samsung-galaxy-z-fold6-first-renders/inline/-1200/gsmarena_004.jpg", "https://fdn.gsmarena.com/imgroot/news/24/02/galaxy-ring-july/-184x111/gsmarena_000.jpg", "https://fdn.gsmarena.com/vv/assets12/i/logo-fallback.gif"], "videos": [], "url": "https://www.gsmarena.com/new_report_confirms_samsung_unpacked_in_early_july_points_at_paris_as_location-news-61814.php", "date": "Thu, 29 Feb 2024 22:53:01 GMT", "short_description": "New report confirms Samsung Unpacked in early to mid July, points at Paris as location - GSMArena.com news  GSMArena.comSamsung's Galaxy Z Fold 6 Is Coming in July, Report Says  CNETSamsung Fans, Mark Your Calendars for July  Droid LifeGalaxy Z Fold and Z Flip 6 renders show off a few design tweaks  Ars TechnicaWhat could a 'Galaxy Fold 6 Ultra' bring that the regular Fold 6 won't probably have?  PhoneArena", "text": "Earlier today, sources close to SamMobile stated that Samsung may hold its annual Unpacked event to unveil its foldable phones, the Galaxy Z Flip6 and Z Fold6, in early July. Now, a separate source coming straight from South Korea also believes the event will be held in early to mid July.\n\nAlleged Galaxy Z Fold6 render\n\nThe report says the Unpacked event will take place about two weeks earlier than last year, when it was held on July 26. That would give us a target around July 12. This new report also names Paris as the purported location. The company wants to time its launch before the start of the Paris Olympics on July 26 in an effort to focus on the European market this year. The Korean tech giant wants to fill the void left by the retreating Chinese smartphone makers.\n\nThe Galaxy Z Fold5 and Z Flip5 got their second debut outside of South Korea about two weeks later in San Francisco, USA, so we wonder if there's going to be an earlier event. Supply chain sources believe the final testing of the products will be in April, way before the July launch date, so there's a slim chance for a domestic launch in South Korea like last year.\n\nMoreover, the report claims there won't be any new foldable or rollable form factors from Samsung this year, but didn't cross the Galaxy Ring off the list.", "publisher": {"href": "https://www.gsmarena.com", "title": "GSMArena.com"}}]}